import { PrismaClient } from "@prisma/client";
export async function seedDepartment(prisma: PrismaClient) {
  await prisma.department.createMany({
    data: [
      { dept: "กลุ่มงานบริหารทั่วไป", deptcode: "30102", office: "งานการเงินและการบัญชี" },
      { dept: "กลุ่มงานประกันสุขภาพยุทธศาสตร์ฯ", deptcode: "30105", office: "งานประกันสุขภาพ" },
      { dept: "กลุ่มการพยาบาล", deptcode: "30407", office: "งานป้องกันและควบคุมการติดเชื้อฯ" },
      { dept: "กลุ่มงานบริหารทั่วไป", deptcode: "30109", office: "งานยานพาหนะ" },
      { dept: "กลุ่มการพยาบาล", deptcode: "30405", office: "งานห้องคลอด" },
      { dept: "กลุ่มการพยาบาล", deptcode: "30403", office: "งานผู้ป่วยนอก" },
      { dept: "กลุ่มการพยาบาล", deptcode: "30402", office: "งานอุบัติเหตุและฉุกเฉิน" },
      { dept: "กลุ่มการพยาบาล", deptcode: "30404", office: "งานผู้ป่วยใน" },
      { dept: "กลุ่มงานบริการด้านปฐมภูมิและองค์รวม", deptcode: "30301", office: "งานศูนย์สุขภาพชุมชนพลูตาหลวง" },
      { dept: "กลุ่มงานประกันสุขภาพยุทธศาสตร์ฯ", deptcode: "30604", office: "งานสารสนเทศทางการแพทย์" },
      { dept: "กลุ่มงานบริการด้านปฐมภูมิและองค์รวม", deptcode: "30302", office: "งานศูนย์สุขภาพชุมชนตำบลสัตหีบ" },
      { dept: "กลุ่มงานบริหารทั่วไป", deptcode: "30108", office: "งานซ่อมบำรุง" },
      { dept: "กลุ่มงานบริหารทั่วไป", deptcode: "30103", office: "งานธุรการและการเจ้าหน้าที่" },
      { dept: "กลุ่มงานบริหารทั่วไป", deptcode: "30104", office: "งานพัสดุ" },
      { dept: "กลุ่มงานทันตกรรม", deptcode: "30202", office: "งานทันตกรรม" },
      { dept: "กลุ่มงานเภสัชกรรมและคุ้มครองผู้บริโภค", deptcode: "30501", office: "งานเภสัชกรรม" },
      { dept: "กลุ่มงานเทคนิคการแพทย์", deptcode: "30502", office: "งานชันสูตร" },
      { dept: "กลุ่มงานรังสีวิทยา", deptcode: "30503", office: "งานรังสีวิทยา" },
      { dept: "กลุ่มงานเวชกรรมฟื้นฟู", deptcode: "30205", office: "งานกายภาพบำบัด" },
      { dept: "กลุ่มงานแพทย์แผนไทยและแพทย์ทางเลือก", deptcode: "30204", office: "งานแพทย์แผนไทย" },
      { dept: "กลุ่มงานแพทย์แผนไทยและแพทย์ทางเลือก", deptcode: "30602", office: "งานแพทย์แผนจีน" },
      { dept: "กลุ่มงานโภชนศาสตร์", deptcode: "30504", office: "งานโภชนศาสตร์" },
      { dept: "กลุ่มงานประกันสุขภาพยุทธศาสตร์ฯ", deptcode: "30601", office: "งานแผนงานและยุทธศาสตร์เครือข่าย" },
      { dept: "กลุ่มงานองค์กรแพทย์", deptcode: "30201", office: "องค์กรแพทย์" },
      { dept: "กลุ่มงานจิตเวชและยาเสพติด", deptcode: "30303", office: "งานจิตเวชและยาเสพติด" },
      // ...
    ],
    skipDuplicates: true,
  });
  console.log("✅ Department seeded");
}


		
		
		
		
		
		
		
		
		
		
		